intro-to-clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc80762">Introduction</a></li>
<li><a href="#orgd0ad0cf">A dev environment</a>
<ul>
<li><a href="#orgade3c86">Vs Code</a></li>
<li><a href="#orga83cb8e">Emacs</a></li>
</ul>
</li>
<li><a href="#org09f1e1e">Nr 1 book for beginners</a></li>
<li><a href="#org3720742">Slack</a></li>
<li><a href="#org229b4f9">Other such lists</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcc80762" class="outline-2">
<h2 id="orgcc80762">Introduction</h2>
<div class="outline-text-2" id="text-orgcc80762">
<p>
Clojure is a modern, functional lisp with a fiercely convinced community and
production orientation.
</p>

<p>
It is a pile of "just get shit done" and produces small, robust, and simple code.
</p>

<p>
A key feature of lisps is that interactivity is foundational.
The magic of making your source code come alive under your fingers is
not describable via words, rather it has to be experienced.
You can try this out yourself by setting up <a href="https://github.com/clojure-emacs/cider">emacs cider</a> or <a href="https://calva.io/getting-started/">calva for vscode</a>.
</p>

<p>
Beyond it being a lisp, it has a unique approach to functional
programming. Firstly by putting a strong emphasis on data orientation,
secondly by being dynamically typed (not typical for functional
languages),
and thirdly by fully embracing the need of state in your program.
</p>

<p>
The idiomatic style of Clojure, that has developed in recent
years has been dubbed <code>data-oriented programming</code>.
It is truly unique and is said to bring back the joy of programming.
For real it is ultra-enabling and feels powerful.
</p>
</div>
</div>

<div id="outline-container-orgd0ad0cf" class="outline-2">
<h2 id="orgd0ad0cf">A dev environment</h2>
<div class="outline-text-2" id="text-orgd0ad0cf">
<p>
Get prepared for your journey as a pilot of an alien spaceship.
As a beginner I suggest either
</p>
</div>

<div id="outline-container-orgade3c86" class="outline-3">
<h3 id="orgade3c86">Vs Code</h3>
<div class="outline-text-3" id="text-orgade3c86">
<p>
Easy to make work. A great editor. You will not need to be ashamed of
your choice. <a href="https://calva.io/getting-started/">calva for vscode</a>
</p>
</div>
</div>

<div id="outline-container-orga83cb8e" class="outline-3">
<h3 id="orga83cb8e">Emacs</h3>
<div class="outline-text-3" id="text-orga83cb8e">
<p>
Strong affinity to hacker culture and a program that is more than a
tool, but eventually an extension to your hands, heart, and mind.
</p>

<p>
Here is a config file I tried to make for beginners:
<a href="https://github.com/benjamin-asdf/simple-easy-emacs">https://github.com/benjamin-asdf/simple-easy-emacs</a>
</p>

<p>
A framework by clojurians that might be just right for you:
<a href="https://github.com/corgi-emacs/corgi">https://github.com/corgi-emacs/corgi</a>
</p>

<p>
There is also doom and spacemacs that enjoy wide appraisal for their
"out of the box" experience.
</p>
</div>
</div>
</div>

<div id="outline-container-org09f1e1e" class="outline-2">
<h2 id="org09f1e1e">Nr 1 book for beginners</h2>
<div class="outline-text-2" id="text-org09f1e1e">
<p>
<a href="https://www.braveclojure.com/clojure-for-the-brave-and-true/">Clojure for the Brave and True</a>
</p>
</div>
</div>

<div id="outline-container-org3720742" class="outline-2">
<h2 id="org3720742">Slack</h2>
<div class="outline-text-2" id="text-org3720742">
<p>
Meet nice people that are excited about the tech <a href="https://clojurians.slack.com/?redir">on slack</a>.
Seriously a lot of people hang there and answer beginner questions,
everybody is welcome.
</p>
</div>
</div>

<div id="outline-container-org229b4f9" class="outline-2">
<h2 id="org229b4f9">Other such lists</h2>
<div class="outline-text-2" id="text-org229b4f9">
<p>
Carin is cool and has a funny picture of the emacs learning curve here:
<a href="https://howistart.org/posts/clojure/1/">https://howistart.org/posts/clojure/1/</a>
</p>

<p>
I like that they have a philosophy section mentioning Rich Hickey's talks
this matters a lot to clojurians.
</p>

<p>
<a href="https://thoughtbot.com/blog/tips-for-clojure-beginners">https://thoughtbot.com/blog/tips-for-clojure-beginners</a>
<a href="https://gist.github.com/yogthos/be323be0361c589570a6da4ccc85f58f">https://gist.github.com/yogthos/be323be0361c589570a6da4ccc85f58f</a>
<a href="https://www.clojurenewbieguide.com/">https://www.clojurenewbieguide.com/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.4)</p>
</div>
</body>
</html>
